Repository: mabocek/mabocek-dotnet-refactoring-challenge
Catalog: RefactoringChallenge.Orchestration/Resources/OrderProcessingMessages.*.resx
Languages: cs

# StartingProcessCustomerOrders
source: Starting to process orders for customer ID: {0}
cs: Zahájení zpracování objednávek pro zákazníka s ID: {0}

# InvalidCustomerId
source: Invalid customer ID: {0}
cs: Neplatné ID zákazníka: {0}

# CustomerIdMustBePositive
source: Customer ID must be a positive number.
cs: ID zákazníka musí být kladné číslo.

# CustomerNotFoundError
source: Customer not found with ID: {0}
cs: Zákazník s ID nebyl nalezen: {0}

# CustomerNotFoundException
source: Customer with ID {0} not found.
cs: Zákazník s ID {0} nebyl nalezen.

# CustomerFound
source: Found customer: {0} (VIP: {1})
cs: Nalezen zákazník: {0} (VIP: {1})

# PendingOrdersFound
source: Found {0} pending orders for customer ID: {1}
cs: Nalezeno {0} čekajících objednávek pro zákazníka s ID: {1}

# OrdersProcessingCompleted
source: Completed processing {0} orders for customer ID: {1}
cs: Dokončeno zpracování {0} objednávek pro zákazníka s ID: {1}

# ProcessingOrderId
source: Processing order ID: {0}
cs: Zpracování objednávky s ID: {0}

# OrderRawTotal
source: Order {0} raw total amount: {1}
cs: Objednávka {0} hrubá celková částka: {1}

# OrderProcessedWithDiscount
source: Order {0} processed with {1}% discount. Final amount: {2}
cs: Objednávka {0} zpracována se slevou {1}%. Konečná částka: {2}

# OrderUpdated
source: Updated order {0} with processed status and discounts
cs: Aktualizována objednávka {0} se stavem zpracováno a slevami

# OrderReady
source: Order {0} is ready for shipping
cs: Objednávka {0} je připravena k odeslání

# OrderCompletedLog
source: Order completed with {0}% discount. Total price: {1}
cs: Objednávka dokončena se slevou {0}%. Celková cena: {1}

# OrderOnHold
source: Order {0} is on hold due to insufficient inventory
cs: Objednávka {0} je pozastavena z důvodu nedostatečných zásob

# OrderOnHoldLog
source: Order on hold. Some items are not on stock.
cs: Objednávka pozastavena. Některé položky nejsou skladem.

# InsufficientInventory
source: Product ID {0} has insufficient inventory. Required: {1}, Available: {2}
cs: Produkt s ID {0} má nedostatečné zásoby. Požadováno: {1}, K dispozici: {2}

# InventoryUpdated
source: Updated inventory for product ID {0}, reduced by {1}
cs: Aktualizovány zásoby pro produkt s ID {0}, sníženo o {1}
